Repository: dodo0822/LocoSwap
Catalog: LocoSwap.Language/Resources/Resources.*.resx
Languages: de, fr, it, nl, ru

source: Add to rules
de: Zu Regeln hinzufügen
fr: Créer règle
it: Aggiungi alle Regole
nl: Aan regels toevoegen
ru: Добавить в правила

# all_vehicles
source: List All Vehicles
de: Alle Fahrzeuge listen
fr: Lister tous les véhicules
it: Lista tutti i Rotabili
nl: Maak een lijst van alle voertuigen
ru: Весь подвижной состав

source: and add as rule
fr: et créer règle
it: e aggiungi alle regole
nl: en als regel toevoegen
ru: Добавить как правило

source: Apply
fr: Appliquer
it: Applicare
nl: Toepassen
ru: Применить

source: Apply all rules
fr: Appliquer toutes les règles
it: Applicare tutte le regole
nl: Alle regels toepassen
ru: Применить все правила

source: Author
fr: Auteur
it: Autore
nl: Auteur
ru: Автор

source: Browse ...
de: Wählen
fr: Parcourir...
it: Navigare ...
nl: Bladeren...
ru: Указать...

source: Cancel
de: Abbrechen
fr: Annuler
nl: Annuleren
ru: Отмена

source: Change number
de: Nummer ändern
fr: Changer numérotation
it: Cambia numero
nl: Verander nummer
ru: Изменить номер

# check_all_scenario_consists
source: Check all scenarios' consists when selecting route (this will be slow!)
fr: Contrôler toutes les rames de tous les scénarios à la sélection d'une route (lent !)
it: Controllare i convogli di tutti gli scenari quando si seleziona il percorso (sarà lento!)
nl: Controleer de treinen van alle scenario's bij het kiezen van de route (dit is langzaam!)
ru: Проверяйте поезда во всех сценариях при выборе маршрута (это будет медленно!).

# clear_vehicles
source: Clear
de: Löschen
fr: Vider
it: Pulisci
nl: Wissen
ru: Очистить

source: Close
de: Schließen
fr: Fermer
it: Chiudi
nl: Sluiten
ru: Закрыть

source: Completion
fr: Terminé
it: Completamento
nl: Voltooiing
ru: Завершён

# completion_completedfailed
source: Failed
fr: Échoué
it: Fallito
nl: Mislukt
ru: Неудачно

# completion_completedsuccessfully
source: Success
fr: Réussi
it: Successo
nl: Succes
ru: Успешно

source: Consists in scenario
de: Züge
fr: Rames du scénario
it: Convoglio nello scenario
nl: Treinen in scenario
ru: Поезда в сценарии

source: Delete
fr: Supprimer
it: Cancella
nl: Verwijderen
ru: Удалить

source: Delete scenarios
fr: Supprimer scénarios
it: Cancella scenario
nl: Scenario's verwijderen
ru: Удалить сценарии

source: Duration
fr: Durée
it: Durata
nl: Duur
ru: Продолжительность

source: Edit scenario
de: Szenario bearbeiten
fr: Éditer le scenario
it: Modifica scenario
nl: Scenario bewerken
ru: Редактировать сценарий

# edit_scenario_title
source: Edit scenario: {0}
de: Szenario bearbeiten: {0}
fr: Éditer le scenario {0}
it: Modifica titolo scenario: {0}
nl: Bewerk scenario: {0}
ru: Редактировать сценарий: {0}

# enter_number_manually
source: Or enter vehicle number manually:
de: Oder hier Fahrzeugnummer manuell eingeben:
fr: Ou saisissez le numéro :
it: O inserisci numero rotabile manualmente:
nl: Of voer hier het voertuignummer handmatig in:
ru: или введите номер вручную:

# error_cannot_read_scenario
source: Error : scenario details cannot be read (malformed XML)
fr: Erreur : impossible de lire les détails du scénario (XML malformé)
nl: Fout: scenariodetails kunnen niet worden gelezen (misvormde XML)
ru: Ошибка: детали сценария не могут быть прочитаны (неправильный XML)

source: Filter
fr: Filtrer
it: Filtra
ru: Фильтр

# flip
source: Flip vehicle
de: Umdrehen
fr: Inverser véhicule
it: Gira rotabile
nl: Voertuig omdraaien
ru: Развернуть объект

source: Flipped?
de: Umgedreht?
fr: Inversé ?
it: Girato?
nl: Omgedraaid?
ru: Развёрнут?

# game_save_date
source: Save date
fr: Date sauvegarde
it: Salva Dati
nl: Bewaar datum
ru: Сохранить дату

source: Hide played scenarios
fr: Cacher scénarios joués
it: Nascondi scenari giocati
nl: Verberg gespeelde scenario's
ru: Скрыть сыгранные сценарии

# insert_after
source: Insert v
de: Einfügen v
fr: Insérer v
it: Inserisci v
nl: Invoegen v
ru: Вставить v

# insert_before
source: Insert ^
de: Einfügen ^
fr: Insérer ^
it: Inserisci ^
nl: Invoegen ^
ru: Вставить ^

# involved_in_consist_operation
source: This vehicle in involved in couple/uncouple instructions. LocoSwap will preserve its number.
fr: Ce véhicule apparaît dans des instructions de couplage/découplage. LocoSwap conservera son numéro.
it: Questo rotabile è coinvolto nelle istruzioni di accoppiamento/disaccoppiamento. LocoSwap conserverà il suo numero.
nl: Dit voertuig is betrokken bij instructies voor koppelen/ontkoppelen. LocoSwap behoudt zijn nummer.
ru: Это объект задействован в инструкциях по сцеплению/расцеплению. При замене локомотива его номер сохранится.

source: Language
de: Sprache
fr: Langue
it: Linguaggio
nl: Taal
ru: Язык

source: Loading...
fr: Chargement...
it: Caricamento...
nl: Bezig met laden...
ru: Загрузка...

source: Look up vehicles
de: Fahrzeugdatei absuchen
fr: Scanner véhicules
it: Cerca Rotabile
nl: Zoek voertuigen op
ru: Поиск подвижного состава

# msg_cannot_load_vehicle
source: Could not load vehicle "{0}"!
de: Fahrzeug "{0}" kann nicht geladen werden!
fr: Impossible de charger le véhicule "{0}"!
it: Impossibile caricare il rotabile "{0}"!
nl: Kan voertuig "{0}" niet laden!
ru: Невозможно загрузить объект "{0}"!

# msg_consist_empty
source: The consist must contain at least one vehicle after the removal!
de: Es muss mindestens ein Fahrzeug nach der Entfernung geben.
fr: Il doit rester au moins un véhicule dans la rame
it: La composizione deve contenere almeno un rotabile dopo la rimozione!
nl: De trein moet na de verwijdering minimaal één voertuig bevatten!
ru: После удаления в составе должен быть по крайней мере один объект!

# msg_error
source: Error
de: Fehler
fr: Erreur
it: Errore
nl: Fout
ru: Ошибка

# msg_first_time
source: First time run: Please select Train Simulator directory.
de: Erster Lauf: bitte Train Simulator-Verzeichnis auswählen
fr: Premier lancement : sélectionnez le chemin de votre Train Simulator
it: Primo avvio: Prego seleziona cartella Train Simulator.
nl: Eerste run: selecteer de Train Simulator-map
ru: Первый запуск: укажите папку Train Simulator.

# msg_flip_completed
source: The selected vehicle(s) are successfully flipped.
de: Die Umdrehung ist erfolgreich abgeschlossen.
fr: Les véhicules sélectionnés ont été inversés
it: Il rotabile selezionato(i) sono girati correttamente.
nl: De geselecteerde voertuig(en) zijn succesvol omgedraaid.
ru: Выбранные объекты были успешно развернуты

# msg_message
source: Message
de: Meldung
it: Messaggio
nl: Bericht
ru: Сообщение

# msg_no_directory_selected
source: Please select a directory first.
de: Bitte erst ein Verzeichnis auswählen.
fr: Merci de sélectionner un dossier.
it: Prego seleziona la cartella prima.
nl: Selecteer eerst een map.
ru: Сначала выберите папку.

# msg_no_vehicle_selected
source: Please select vehicles first.
de: Bitte erst Fahrzeugen auswählen.
fr: Merci de sélectionner un véhicule.
it: Prego seleziona rotabile prima.
nl: Selecteer eerst voertuigen.
ru: Сначала выберите подвижной состав.

# msg_scenario_saved
source: Scenario files successfully saved.
de: Szenariodatei ist erfolgreich gespeichert.
fr: Le scénario a bien été sauvegardé.
it: Files scenario salvati con successo.
nl: Scenariobestanden zijn succesvol opgeslagen.
ru: Сценарий успешно сохранен.

# msg_swap_completed
source: Swap successfully completed.
de: Der Austausch ist erfolgreich abgeschlossen.
it: Cambio completato con successo.
nl: Omwisseling succesvol afgerond.
ru: Замена прошла успешно.

# msg_ts_path_invalid
source: Selected path is invalid! (Check if it contains RailWorks.exe)
de: Der eingegebene TS-Pfad ist ungültig! (bitte prüfen, dass RailWorks.exe steht dort)
fr: Le chemin sélectionné est invalide ! (Vérifiez qu'il contient RailWorks.exe)
it: Il percorso selezionato non è valido! (Controlla se contiene RailWorks.exe)
nl: Geselecteerd pad is ongeldig! (Controleer of het RailWorks.exe bevat)
ru: Выбранный путь неверен! (проверьте наличие RailWorks.exe в папке)

# msg_ts_path_required
source: A valid TS path is required to run this application. The application will now exit.
de: Ein gültige Train Simulator-Pfad ist erforderlich, um diese App auszuführen. Die App wird nun beendet.
fr: Un chemin valide vers TS est nécessaire à cette application. L'application va se terminer.
it: Un percorso di TS è richiesto per eseguire questa applicazione. L'applicazione verrà chiusa.
nl: Er is een geldig TS-pad vereist om deze toepassing uit te voeren. De toepassing wordt nu afgesloten.
ru: Для запуска программы требуется правильный путь установки TS. Программа будет закрыта.

# msg_vehicles_added_to_rules
source: Vehicles successfully added to replacement rules.
de: Fahrzeug ist zu Tausch-Regeln hinzugefügt.
fr: Les règles ont bien été créées pour ces véhicules.
it: Rotabile aggiunto con successo alle regole di sostituzione.
nl: Voertuigen succesvol toegevoegd aan vervangingsregels.
ru: Состав успешно добавлен в список правил для замены.

# msg_vehicle_already_in_rules
source: Vehicle "{0}" is already in replacement rules! Update this rule?
de: Fahrzeug "{0}" ist bereits in Tausch-Regeln! Möchten Sie diese Regel aktualisieren?
fr: Le véhicule "{0}" a déjà une règle de remplacement. Écraser cette règle ?
it: Rotabile "{0}" è già aggiunto alle regole di sostituzione! Aggiorno questa regola?
nl: Voertuig "{0}" is al in vervangende regels! Deze regel updaten?
ru: Состав "{0}" уже в списке правил замены! Заменить существующее правило?

# msg_write_access_denied
source: Access denied while trying to write to scenario files. Please check that Scenario.bin and ScenarioProperties.xml are not write protected.
de: Zugriff der Szenariodateien ist verweigert. Bitte prüfen, dass "Scenario.bin" und "ScenarioProperties.xml" nicht schreibgeschützt sind.
fr: Accès en écriture refusé. Vérifiez que Scenario.bin et ScenarioProperties.xml ne sont pas protégés en écriture.
it: Accesso negato durante il tentativo di scrittura nei file dello scenario. Verificare che Scenario.bin e ScenarioProperties.xml non siano protetti da scrittura.
nl: Toegang geweigerd tijdens poging om naar scenariobestanden te schrijven. Controleer of Scenario.bin en ScenarioProperties.xml niet tegen schrijven zijn beveiligd.
ru: Доступ для сохранения сценария запрещен. Пожалуйста, проверьте, что файлы Scenario.bin и ScenarioProperties.xml не защищены от перезаписи.

source: Name
fr: Nom
it: Nome
nl: Naam
ru: Название

source: New vehicle selected
de: Gewünschtes Fahrzeug (rechte Seite):
fr: Nouveau véhicule sélectionné
it: Nuovo rotabile selezionato
nl: Nieuw voertuig geselecteerd
ru: Новый подвижной состав

source: Number
de: Nummer
fr: Numéro
it: Numero
nl: Nummer
ru: Номер

source: Numbering list
de: Nummerierungliste
fr: Liste de numérotation
it: Lista di numerazione
nl: Nummeringslijst
ru: Список номеров

# numbering_list_not_found
source: Numbering list not found; please enter number manually.
de: Nummerierungliste ist nicht gefunden; bitte Nummer manuell eingeben
fr: Pas de liste de numérotation trouvée. Saisissez le numéro manuellement.
it: Lista di numerazione non trovata; si prega di inserire il numero manualmente.
nl: Nummeringslijst niet gevonden; voer het nummer handmatig in.
ru: Список номеров не найден; пожалуйста, укажите номера вручную.

# only_on_missing_stock
source: only on missing stock (yellows)
fr: uniquement aux véhicules manquants (en jaune)
it: solo su magazzino mancante (Giallo)
nl: alleen op ontbrekend materieel (geel)
ru: только в недостающем подвижном составе (желтые)

source: on all stock
fr: à tous les véhicules
it: su tutto il magazzino
nl: op alle materieel
ru: во всём подвижном составе

source: Open scenario directory
de: Szenario-Verzeichnis öffnen
fr: Ouvrir le dossier du scénario
it: Apri Cartella scenario
nl: Open scenariomap
ru: Открыть папку сценария

source: Path
de: Pfad
fr: Chemin
it: Percorso
nl: Pad
ru: Путь

# player_train_name
source: Player train
fr: Train du joueur
it: Treno Giocatore
nl: Speler trein
ru: Поезд игрока

source: Reading scenario files...
de: Szenariodatei wird geladen...
fr: Chargement du scénario...
it: Leggendo i files scenario...
nl: Scenariobestanden lezen...
ru: Чтение файлов сценария...

source: Remove
de: Entfernen
fr: Supprimer
it: Rimuovi
nl: Verwijderen
ru: Удалить

source: Replace
de: Tauschen
fr: Remplacer
it: Sostituzione
nl: Vervangen
ru: Заменить

source: Replacement rules
de: Tausch-Regeln
fr: Règles de remplacement
it: Sostituzione regole
nl: Vervangende regels
ru: Правила замены

source: Replacement rules management
fr: Gestion des règles de remplacement
it: Sostituzione regole amministrazione
nl: Vervangende regels beheren
ru: Управление правилами замены

source: Replace identical
de: Alle gleiche tauschen
fr: Remplacer les identiques
it: Rimpiazza identico
nl: Alle identieke vervangen
ru: Заменить идентичные

source: Replace with
de: Gegen ... tauschen:
fr: Remplacer par
it: Sostituisci con
nl: Door ... vervangen
ru: Чем заменить

source: Route
de: Strecke
fr: Ligne
it: Rotta
ru: Маршрут

source: Rule
fr: Règle
it: Regola
nl: Regel
ru: Правило

# rule_find
source: Search for...
de: Nach ... suchen
fr: Chercher...
it: Cercare...
nl: Naar ... zoeken
ru: Искать...

# rule_replace
source: Replace with...
de: Durch ... ersetzen
fr: Remplacer par...
it: Sostituisci regola con...
nl: Door ... vervangen
ru: Чем заменить...

source: Save
de: Speichern
fr: Sauvegarder
it: Salva
nl: Opslaan
ru: Сохранить

# saving_scenario
source: Saving scenario files...
de: Szenariodatei wird gespeichert.
fr: Enregistrement du scénario...
it: Salvataggio files scenario...
nl: Scenariobestanden opslaan...
ru: Сохранение файлов сценария...

# scanning_ap_files
source: Scanning in .ap files...
de: .ap-Pakete durchsuchen...
fr: Scan des fichiers .ap...
it: Cerco negli .ap files...
nl: Scannen in .ap-bestanden...
ru: Сканирование в .ap файлах...

# scanning_bin_files
source: Scanning for vehicle .bin files...
de: Nach .bin-Dateien durchsuchen...
fr: Scan des fichiers .bin...
it: Cercando nei rotabili files .bin ...
nl: Scannen naar voertuig .bin bestanden...
ru: Сканирование объектов в .bin файлах...

source: Scenario
de: Szenario
fr: Scénario
ru: Сценарий

# scenario_delete_prompt_message
source: Are you sure you want to delete the selected scenario(s) ?
fr: Etes-vous sûr de vouloir supprimer le(s) scénario(s) sélectionné(s) ?
it: Sei sicuro di voler cancellare lo scenario(i) selezionato?
nl: Weet u zeker dat u de geselecteerde scenario's wilt verwijderen?
ru: Вы уверены, что хотите удалить выбранные сценарии?

# scenario_delete_prompt_title
source: Scenarios deletion
fr: Suppression de scénario(s)
it: Cancellazione scenario
nl: Scenario's verwijderen
ru: Удаление сценариев

# scenario_in_ap
source: *** This scenario is contained in an .ap file. LocoSwap will automatically extract it on save. ***
fr: *** Ce scénario est dans un fichier .ap. LocoSwap l'extraira automatiquement au moment de la sauvegarde. ***
nl: *** Dit scenario is opgenomen in een .ap-bestand. LocoSwap zal het automatisch uitpakken bij het opslaan. ***
ru: *** Этот сценарий в .ap файле LocoSwap автоматически извлечёт его при сохранении. ***

source: Scenario name suffix
fr: Suffixe au nom du scénario
it: Suffisso nome scenario
nl: Suffix scenarionaam
ru: Суффикс имени сценария

source: Season
fr: Saison
it: Stagione
nl: Seizoen
ru: Сезон

# season_autumn
source: Autumn
fr: Automne
it: Autunno
nl: Herfst
ru: Осень

# season_spring
source: Spring
fr: Printemps
it: Primavera
nl: Lente
ru: Весна

# season_summer
source: Summer
fr: Été
it: Estate
nl: Zomer
ru: Лето

# season_winter
source: Winter
fr: Hiver
it: Inverno
ru: Зима

# select_ts_path
source: Select Train Simulator Path
de: Train Simulator-Pfad auswählen
fr: Sélectionnez le chemin de Train Simulator
it: Seleziona percorso TS
nl: Selecteer Train Simulator-pad
ru: Укажите путь к Train Simulator

source: Settings
de: Einstellung
fr: Options
it: Settaggi
nl: Instellingen
ru: Настройки

source: Start time
fr: Heure
it: Tempo inizio
nl: Starttijd
ru: Время начала

# ts_directory
source: Train Simulator directory
de: Train Simulator-Pfad
fr: Dossier Train Simulator
it: Train Simulator cartella
nl: Train Simulator-map
ru: Папка Train Simulator

source: Use system language
de: Systemsprache verwenden
fr: Utiliser la langue système
it: Usa linguaggio di sistema
nl: Systeemtaal gebruiken
ru: Использовать системный язык

source: Vehicles in selected consist
de: Fahrzeuge im ausgewählten Zug
fr: Véhicules de la rame
it: Rotabile nel convoglio selezionato
nl: Voertuigen in geselecteerde trein
ru: Подвижной состав в выбранном поезде

# vehicle_selected
source: Selected vehicle
de: Ausgewältes Fahrzeug
fr: Véhicule sélectionné
it: Rotabile selezionato
nl: Geselecteerd voertuig
ru: Выбранный подвижной состав

source: Vehicle to be replaced
de: Dieses Fahrzeug wird getauscht (linke Seite):
fr: Véhicule à remplacer
it: Rotabile è stato sostituito
nl: Dit voertuig wordt vervangen
ru: Заменяемый подвижной состав

source: Open manual
fr: Ouvrir le manuel
nl: Handleiding openen
